{"class_name": "Tokenizer", "config": {"num_words": 5000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 15, "word_counts": "{\"deep\": 1, \"learning\": 4, \"is\": 11, \"part\": 1, \"of\": 8, \"machine\": 2, \"based\": 1, \"on\": 1, \"artificial\": 4, \"neural\": 1, \"networks\": 1, \"it\": 5, \"attempts\": 1, \"to\": 9, \"mimic\": 1, \"the\": 10, \"human\": 2, \"brain's\": 1, \"ability\": 2, \"process\": 1, \"data\": 2, \"and\": 10, \"create\": 1, \"patterns\": 1, \"for\": 7, \"decision\": 1, \"making\": 1, \"a\": 9, \"subset\": 1, \"intelligence\": 4, \"that\": 10, \"provides\": 1, \"systems\": 2, \"automatically\": 1, \"learn\": 3, \"improve\": 1, \"from\": 1, \"experience\": 1, \"without\": 1, \"being\": 1, \"explicitly\": 1, \"programmed\": 1, \"question\": 6, \"i'd\": 2, \"like\": 5, \"about\": 3, \"can\": 3, \"you\": 7, \"explain\": 2, \"answer\": 6, \"are\": 1, \"ok\": 1, \"how\": 2, \"do\": 1, \"work\": 1, \"ai\": 2, \"refers\": 1, \"perform\": 1, \"tasks\": 1, \"typically\": 1, \"require\": 1, \"this\": 1, \"includes\": 1, \"reasoning\": 1, \"problem\": 1, \"solving\": 1, \"perception\": 1, \"language\": 6, \"understanding\": 1, \"html\": 2, \"hypertext\": 1, \"markup\": 2, \"standard\": 1, \"web\": 4, \"pages\": 1, \"css\": 1, \"cascading\": 1, \"style\": 2, \"sheets\": 1, \"sheet\": 1, \"used\": 3, \"describing\": 1, \"presentation\": 1, \"document\": 1, \"written\": 1, \"in\": 4, \"javascript\": 1, \"programming\": 2, \"primarily\": 1, \"creating\": 1, \"interactive\": 1, \"effects\": 1, \"within\": 1, \"browsers\": 1, \"it's\": 2, \"an\": 2, \"essential\": 1, \"technology\": 1, \"development\": 2, \"python\": 1, \"high\": 1, \"level\": 1, \"interpreted\": 1, \"known\": 1, \"its\": 3, \"readability\": 1, \"simplicity\": 1, \"widely\": 1, \"analysis\": 1, \"automation\": 1, \"biology\": 1, \"scientific\": 2, \"study\": 2, \"life\": 1, \"natural\": 2, \"science\": 3, \"with\": 2, \"broad\": 1, \"scope\": 1, \"but\": 1, \"has\": 1, \"several\": 1, \"unifying\": 1, \"themes\": 1, \"tie\": 1, \"together\": 1, \"as\": 1, \"single\": 1, \"coherent\": 1, \"field\": 1, \"chemistry\": 1, \"properties\": 1, \"behavior\": 2, \"matter\": 3, \"physical\": 1, \"covers\": 1, \"elements\": 1, \"make\": 1, \"up\": 1, \"compounds\": 1, \"composed\": 1, \"atoms\": 1, \"molecules\": 1, \"or\": 1, \"ions\": 1, \"physics\": 1, \"studies\": 1, \"fundamental\": 1, \"constituents\": 1, \"motion\": 1, \"through\": 1, \"space\": 1, \"time\": 1, \"related\": 1, \"entities\": 1, \"energy\": 1, \"force\": 1, \"i'm\": 1, \"not\": 4, \"familiar\": 1, \"what\": 1, \"should\": 1, \"i\": 1, \"know\": 1, \"huh\": 2, \"that's\": 3, \"my\": 3, \"knowledge\": 3, \"base\": 3, \"would\": 3, \"teach\": 3, \"me\": 3, \"whats\": 1, \"simple\": 1}", "word_docs": "{\"process\": 1, \"the\": 6, \"on\": 1, \"artificial\": 4, \"based\": 1, \"learning\": 3, \"deep\": 1, \"for\": 4, \"is\": 8, \"brain's\": 1, \"it\": 4, \"data\": 2, \"decision\": 1, \"networks\": 1, \"part\": 1, \"create\": 1, \"mimic\": 1, \"machine\": 2, \"of\": 6, \"attempts\": 1, \"and\": 6, \"to\": 8, \"making\": 1, \"ability\": 2, \"neural\": 1, \"human\": 2, \"patterns\": 1, \"subset\": 1, \"from\": 1, \"that\": 8, \"explicitly\": 1, \"a\": 6, \"automatically\": 1, \"provides\": 1, \"intelligence\": 3, \"systems\": 2, \"being\": 1, \"improve\": 1, \"without\": 1, \"experience\": 1, \"learn\": 3, \"programmed\": 1, \"i'd\": 2, \"question\": 6, \"about\": 3, \"like\": 5, \"are\": 1, \"can\": 3, \"ok\": 1, \"answer\": 6, \"explain\": 2, \"you\": 5, \"how\": 2, \"do\": 1, \"work\": 1, \"require\": 1, \"tasks\": 1, \"perception\": 1, \"refers\": 1, \"includes\": 1, \"this\": 1, \"problem\": 1, \"reasoning\": 1, \"ai\": 2, \"solving\": 1, \"language\": 4, \"understanding\": 1, \"typically\": 1, \"perform\": 1, \"html\": 1, \"document\": 1, \"markup\": 1, \"used\": 3, \"in\": 4, \"sheet\": 1, \"css\": 1, \"style\": 1, \"cascading\": 1, \"sheets\": 1, \"web\": 3, \"hypertext\": 1, \"presentation\": 1, \"standard\": 1, \"describing\": 1, \"written\": 1, \"pages\": 1, \"it's\": 2, \"technology\": 1, \"within\": 1, \"browsers\": 1, \"javascript\": 1, \"primarily\": 1, \"an\": 2, \"effects\": 1, \"interactive\": 1, \"creating\": 1, \"development\": 2, \"programming\": 2, \"essential\": 1, \"its\": 2, \"analysis\": 1, \"level\": 1, \"interpreted\": 1, \"python\": 1, \"known\": 1, \"widely\": 1, \"simplicity\": 1, \"readability\": 1, \"high\": 1, \"automation\": 1, \"scientific\": 2, \"unifying\": 1, \"science\": 3, \"but\": 1, \"study\": 2, \"coherent\": 1, \"together\": 1, \"field\": 1, \"several\": 1, \"themes\": 1, \"single\": 1, \"with\": 2, \"life\": 1, \"scope\": 1, \"as\": 1, \"has\": 1, \"natural\": 2, \"biology\": 1, \"broad\": 1, \"tie\": 1, \"physical\": 1, \"make\": 1, \"chemistry\": 1, \"molecules\": 1, \"properties\": 1, \"elements\": 1, \"behavior\": 2, \"ions\": 1, \"composed\": 1, \"or\": 1, \"compounds\": 1, \"covers\": 1, \"up\": 1, \"atoms\": 1, \"matter\": 2, \"motion\": 1, \"constituents\": 1, \"physics\": 1, \"energy\": 1, \"related\": 1, \"studies\": 1, \"time\": 1, \"through\": 1, \"force\": 1, \"entities\": 1, \"fundamental\": 1, \"space\": 1, \"huh\": 2, \"i'm\": 1, \"familiar\": 1, \"what\": 1, \"should\": 1, \"know\": 1, \"not\": 4, \"i\": 1, \"base\": 3, \"would\": 3, \"knowledge\": 3, \"teach\": 3, \"my\": 3, \"me\": 3, \"that's\": 3, \"whats\": 1, \"simple\": 1}", "index_docs": "{\"66\": 1, \"2\": 6, \"60\": 1, \"16\": 4, \"59\": 1, \"15\": 3, \"57\": 1, \"8\": 4, \"1\": 8, \"65\": 1, \"13\": 4, \"38\": 2, \"69\": 1, \"62\": 1, \"58\": 1, \"67\": 1, \"64\": 1, \"35\": 2, \"7\": 6, \"63\": 1, \"3\": 6, \"5\": 8, \"70\": 1, \"37\": 2, \"61\": 1, \"36\": 2, \"68\": 1, \"71\": 1, \"75\": 1, \"4\": 8, \"79\": 1, \"6\": 6, \"73\": 1, \"72\": 1, \"17\": 3, \"39\": 2, \"78\": 1, \"74\": 1, \"77\": 1, \"76\": 1, \"21\": 3, \"80\": 1, \"40\": 2, \"10\": 6, \"22\": 3, \"14\": 5, \"81\": 1, \"23\": 3, \"82\": 1, \"11\": 6, \"41\": 2, \"9\": 5, \"42\": 2, \"83\": 1, \"84\": 1, \"89\": 1, \"87\": 1, \"95\": 1, \"85\": 1, \"91\": 1, \"90\": 1, \"93\": 1, \"92\": 1, \"43\": 2, \"94\": 1, \"12\": 4, \"96\": 1, \"88\": 1, \"86\": 1, \"44\": 1, \"106\": 1, \"45\": 1, \"24\": 3, \"19\": 4, \"103\": 1, \"100\": 1, \"46\": 1, \"101\": 1, \"102\": 1, \"18\": 3, \"97\": 1, \"105\": 1, \"98\": 1, \"104\": 1, \"107\": 1, \"99\": 1, \"48\": 2, \"116\": 1, \"113\": 1, \"114\": 1, \"108\": 1, \"109\": 1, \"49\": 2, \"112\": 1, \"111\": 1, \"110\": 1, \"50\": 2, \"47\": 2, \"115\": 1, \"25\": 2, \"125\": 1, \"119\": 1, \"120\": 1, \"117\": 1, \"121\": 1, \"124\": 1, \"123\": 1, \"122\": 1, \"118\": 1, \"126\": 1, \"51\": 2, \"134\": 1, \"26\": 3, \"131\": 1, \"52\": 2, \"140\": 1, \"137\": 1, \"141\": 1, \"133\": 1, \"135\": 1, \"139\": 1, \"54\": 2, \"128\": 1, \"130\": 1, \"138\": 1, \"132\": 1, \"53\": 2, \"127\": 1, \"129\": 1, \"136\": 1, \"144\": 1, \"147\": 1, \"142\": 1, \"152\": 1, \"143\": 1, \"146\": 1, \"55\": 2, \"154\": 1, \"150\": 1, \"153\": 1, \"149\": 1, \"145\": 1, \"148\": 1, \"151\": 1, \"27\": 2, \"159\": 1, \"158\": 1, \"155\": 1, \"165\": 1, \"163\": 1, \"156\": 1, \"162\": 1, \"160\": 1, \"166\": 1, \"164\": 1, \"157\": 1, \"161\": 1, \"56\": 2, \"167\": 1, \"168\": 1, \"169\": 1, \"170\": 1, \"172\": 1, \"20\": 4, \"171\": 1, \"31\": 3, \"32\": 3, \"30\": 3, \"33\": 3, \"29\": 3, \"34\": 3, \"28\": 3, \"173\": 1, \"174\": 1}", "index_word": "{\"1\": \"is\", \"2\": \"the\", \"3\": \"and\", \"4\": \"that\", \"5\": \"to\", \"6\": \"a\", \"7\": \"of\", \"8\": \"for\", \"9\": \"you\", \"10\": \"question\", \"11\": \"answer\", \"12\": \"language\", \"13\": \"it\", \"14\": \"like\", \"15\": \"learning\", \"16\": \"artificial\", \"17\": \"intelligence\", \"18\": \"web\", \"19\": \"in\", \"20\": \"not\", \"21\": \"learn\", \"22\": \"about\", \"23\": \"can\", \"24\": \"used\", \"25\": \"its\", \"26\": \"science\", \"27\": \"matter\", \"28\": \"that's\", \"29\": \"my\", \"30\": \"knowledge\", \"31\": \"base\", \"32\": \"would\", \"33\": \"teach\", \"34\": \"me\", \"35\": \"machine\", \"36\": \"human\", \"37\": \"ability\", \"38\": \"data\", \"39\": \"systems\", \"40\": \"i'd\", \"41\": \"explain\", \"42\": \"how\", \"43\": \"ai\", \"44\": \"html\", \"45\": \"markup\", \"46\": \"style\", \"47\": \"programming\", \"48\": \"it's\", \"49\": \"an\", \"50\": \"development\", \"51\": \"scientific\", \"52\": \"study\", \"53\": \"natural\", \"54\": \"with\", \"55\": \"behavior\", \"56\": \"huh\", \"57\": \"deep\", \"58\": \"part\", \"59\": \"based\", \"60\": \"on\", \"61\": \"neural\", \"62\": \"networks\", \"63\": \"attempts\", \"64\": \"mimic\", \"65\": \"brain's\", \"66\": \"process\", \"67\": \"create\", \"68\": \"patterns\", \"69\": \"decision\", \"70\": \"making\", \"71\": \"subset\", \"72\": \"provides\", \"73\": \"automatically\", \"74\": \"improve\", \"75\": \"from\", \"76\": \"experience\", \"77\": \"without\", \"78\": \"being\", \"79\": \"explicitly\", \"80\": \"programmed\", \"81\": \"are\", \"82\": \"ok\", \"83\": \"do\", \"84\": \"work\", \"85\": \"refers\", \"86\": \"perform\", \"87\": \"tasks\", \"88\": \"typically\", \"89\": \"require\", \"90\": \"this\", \"91\": \"includes\", \"92\": \"reasoning\", \"93\": \"problem\", \"94\": \"solving\", \"95\": \"perception\", \"96\": \"understanding\", \"97\": \"hypertext\", \"98\": \"standard\", \"99\": \"pages\", \"100\": \"css\", \"101\": \"cascading\", \"102\": \"sheets\", \"103\": \"sheet\", \"104\": \"describing\", \"105\": \"presentation\", \"106\": \"document\", \"107\": \"written\", \"108\": \"javascript\", \"109\": \"primarily\", \"110\": \"creating\", \"111\": \"interactive\", \"112\": \"effects\", \"113\": \"within\", \"114\": \"browsers\", \"115\": \"essential\", \"116\": \"technology\", \"117\": \"python\", \"118\": \"high\", \"119\": \"level\", \"120\": \"interpreted\", \"121\": \"known\", \"122\": \"readability\", \"123\": \"simplicity\", \"124\": \"widely\", \"125\": \"analysis\", \"126\": \"automation\", \"127\": \"biology\", \"128\": \"life\", \"129\": \"broad\", \"130\": \"scope\", \"131\": \"but\", \"132\": \"has\", \"133\": \"several\", \"134\": \"unifying\", \"135\": \"themes\", \"136\": \"tie\", \"137\": \"together\", \"138\": \"as\", \"139\": \"single\", \"140\": \"coherent\", \"141\": \"field\", \"142\": \"chemistry\", \"143\": \"properties\", \"144\": \"physical\", \"145\": \"covers\", \"146\": \"elements\", \"147\": \"make\", \"148\": \"up\", \"149\": \"compounds\", \"150\": \"composed\", \"151\": \"atoms\", \"152\": \"molecules\", \"153\": \"or\", \"154\": \"ions\", \"155\": \"physics\", \"156\": \"studies\", \"157\": \"fundamental\", \"158\": \"constituents\", \"159\": \"motion\", \"160\": \"through\", \"161\": \"space\", \"162\": \"time\", \"163\": \"related\", \"164\": \"entities\", \"165\": \"energy\", \"166\": \"force\", \"167\": \"i'm\", \"168\": \"familiar\", \"169\": \"what\", \"170\": \"should\", \"171\": \"i\", \"172\": \"know\", \"173\": \"whats\", \"174\": \"simple\"}", "word_index": "{\"is\": 1, \"the\": 2, \"and\": 3, \"that\": 4, \"to\": 5, \"a\": 6, \"of\": 7, \"for\": 8, \"you\": 9, \"question\": 10, \"answer\": 11, \"language\": 12, \"it\": 13, \"like\": 14, \"learning\": 15, \"artificial\": 16, \"intelligence\": 17, \"web\": 18, \"in\": 19, \"not\": 20, \"learn\": 21, \"about\": 22, \"can\": 23, \"used\": 24, \"its\": 25, \"science\": 26, \"matter\": 27, \"that's\": 28, \"my\": 29, \"knowledge\": 30, \"base\": 31, \"would\": 32, \"teach\": 33, \"me\": 34, \"machine\": 35, \"human\": 36, \"ability\": 37, \"data\": 38, \"systems\": 39, \"i'd\": 40, \"explain\": 41, \"how\": 42, \"ai\": 43, \"html\": 44, \"markup\": 45, \"style\": 46, \"programming\": 47, \"it's\": 48, \"an\": 49, \"development\": 50, \"scientific\": 51, \"study\": 52, \"natural\": 53, \"with\": 54, \"behavior\": 55, \"huh\": 56, \"deep\": 57, \"part\": 58, \"based\": 59, \"on\": 60, \"neural\": 61, \"networks\": 62, \"attempts\": 63, \"mimic\": 64, \"brain's\": 65, \"process\": 66, \"create\": 67, \"patterns\": 68, \"decision\": 69, \"making\": 70, \"subset\": 71, \"provides\": 72, \"automatically\": 73, \"improve\": 74, \"from\": 75, \"experience\": 76, \"without\": 77, \"being\": 78, \"explicitly\": 79, \"programmed\": 80, \"are\": 81, \"ok\": 82, \"do\": 83, \"work\": 84, \"refers\": 85, \"perform\": 86, \"tasks\": 87, \"typically\": 88, \"require\": 89, \"this\": 90, \"includes\": 91, \"reasoning\": 92, \"problem\": 93, \"solving\": 94, \"perception\": 95, \"understanding\": 96, \"hypertext\": 97, \"standard\": 98, \"pages\": 99, \"css\": 100, \"cascading\": 101, \"sheets\": 102, \"sheet\": 103, \"describing\": 104, \"presentation\": 105, \"document\": 106, \"written\": 107, \"javascript\": 108, \"primarily\": 109, \"creating\": 110, \"interactive\": 111, \"effects\": 112, \"within\": 113, \"browsers\": 114, \"essential\": 115, \"technology\": 116, \"python\": 117, \"high\": 118, \"level\": 119, \"interpreted\": 120, \"known\": 121, \"readability\": 122, \"simplicity\": 123, \"widely\": 124, \"analysis\": 125, \"automation\": 126, \"biology\": 127, \"life\": 128, \"broad\": 129, \"scope\": 130, \"but\": 131, \"has\": 132, \"several\": 133, \"unifying\": 134, \"themes\": 135, \"tie\": 136, \"together\": 137, \"as\": 138, \"single\": 139, \"coherent\": 140, \"field\": 141, \"chemistry\": 142, \"properties\": 143, \"physical\": 144, \"covers\": 145, \"elements\": 146, \"make\": 147, \"up\": 148, \"compounds\": 149, \"composed\": 150, \"atoms\": 151, \"molecules\": 152, \"or\": 153, \"ions\": 154, \"physics\": 155, \"studies\": 156, \"fundamental\": 157, \"constituents\": 158, \"motion\": 159, \"through\": 160, \"space\": 161, \"time\": 162, \"related\": 163, \"entities\": 164, \"energy\": 165, \"force\": 166, \"i'm\": 167, \"familiar\": 168, \"what\": 169, \"should\": 170, \"i\": 171, \"know\": 172, \"whats\": 173, \"simple\": 174}"}}